

import '../model/question_model.dart';

List<QuestionModel> questions = [
  QuestionModel(
    "كون جملة من الكلمات الآتية :  محمد - اللبن - يشرب",
    {
      "اللبن يشرب محمد": false,
      "يشرب اللبن محمد": false,
      "محمد اللبن يشرب": false,
      "يشرب محمد اللبن": true,
    },
  ),
  QuestionModel("كون جملة من الكلمات الآتية :  للتسوق - مع - ذهب - والدتة - علي", {
    "مع والدته للتسوق ذهب علي": false,
    "للتسوق ذهب مع والدته علي": false,
    "ذهب علي للتسوق مع والدته": true,
    "مع ذهب علي للتسوق والدته": false,
  }),
  QuestionModel("كون جملة من الكلمات الآتية :  القط - اعداء - والفأر", {
    "القط والفأر اعداء": true,
    "لا يوجد جملة صحيحة": false,
    "اعداء القط والفأر": false,
    "القط والفأر أصدقاء": false,
  }),
  QuestionModel("كون جملة من الكلمات الآتية :  يجب - غسل - عليك - يديك - الاكل - قبل", {
    "يجب عليك غسل يديك قبل الاكل": true,
    "الاكل قبل يديك يجب غسل عليك": false,
    "غسل عليك قبل الاكل يجب يديك": false,
    "كل ما سبق": false,
  }),
  QuestionModel("كون جملة من الكلمات الآتية :  لن - يأتي - اليوم - سعيد - وهو -المطار - قادم - احمد - من", {
    "لن يأتي اليوم احمد وهو قادم من المطار سعيد":true ,
    "عيد وهو قادم من المطار لن يأتي اليوم احمد": false,
    "كل ما سبق": false,
    "لا يوجد جملة صحيحه":false ,
  }),

];
