

import '../model/question_model.dart';

List<QuestionModel> questions = [
  QuestionModel(
    "4 + 3",
    {
      "6": false,
      "8": false,
      "2": false,
      "7": true,
    },
  ),
  QuestionModel("10 - 7", {
    "2": false,
    "4": false,
    "3": true,
    "17": false,
  }),
  QuestionModel("9 / 3 ", {
    "3": true,
    "12": false,
    "6": false,
    "1": false,
  }),
  QuestionModel("3 + 7", {
    "10": true,
    "12": false,
    "4": false,
    "2": false,
  }),
  QuestionModel("15 - 2", {
    "13":true ,
    "11": false,
    "12": false,
    "10":false ,
  }),

  QuestionModel(
    "الى ماذا يرمز هذا العدد : 1",
    {
      "اثنان": false,
      "اربعة": false,
      "سبعه": false,
      "واحد": true,
    },
  ),
  QuestionModel("الى ماذا يرمز هذا العدد : 6", {
    "خمسة": false,
    "ثلاثة": false,
    "ستة": true,
    "عشرة": false,
  }),
  QuestionModel("الى ماذا يرمز هذا العدد : 13", {
    "ثلاثة عشر": true,
    "خمسة": false,
    "عشرون": false,
    "ثمانية": false,
  }),
  QuestionModel("الى ماذا يرمز هذا العدد : 22", {
    "اثنان وعشرون": true,
    "ثلاثة": false,
    "سبعه وثلاثون": false,
    "اربعه": false,
  }),
  QuestionModel("الى ماذا يرمز هذا العدد : 15", {
    "خمسة عشر":true ,
    "واحد": false,
    "ستة عشر": false,
    "عشرون":false ,
  }),

  QuestionModel(
    "كون جملة من الكلمات الآتية :  محمد - اللبن - يشرب",
    {
      "اللبن يشرب محمد": false,
      "يشرب اللبن محمد": false,
      "محمد اللبن يشرب": false,
      "يشرب محمد اللبن": true,
    },
  ),
  QuestionModel("كون جملة من الكلمات الآتية :  للتسوق - مع - ذهب - والدتة - علي", {
    "مع والدته للتسوق ذهب علي": false,
    "للتسوق ذهب مع والدته علي": false,
    "ذهب علي للتسوق مع والدته": true,
    "مع ذهب علي للتسوق والدته": false,
  }),
  QuestionModel("كون جملة من الكلمات الآتية :  القط - اعداء - والفأر", {
    "القط والفأر اعداء": true,
    "لا يوجد جملة صحيحة": false,
    "اعداء القط والفأر": false,
    "القط والفأر أصدقاء": false,
  }),
  QuestionModel("كون جملة من الكلمات الآتية :  يجب - غسل - عليك - يديك - الاكل - قبل", {
    "يجب عليك غسل يديك قبل الاكل": true,
    "الاكل قبل يديك يجب غسل عليك": false,
    "غسل عليك قبل الاكل يجب يديك": false,
    "كل ما سبق": false,
  }),
  QuestionModel("كون جملة من الكلمات الآتية :  لن - يأتي - اليوم - سعيد - وهو -المطار - قادم - احمد - من", {
    "لن يأتي اليوم احمد وهو قادم من المطار سعيد":true ,
    "عيد وهو قادم من المطار لن يأتي اليوم احمد": false,
    "كل ما سبق": false,
    "لا يوجد جملة صحيحه":false ,
  }),

  QuestionModel(
    "أكمل الجملة الاتية :  محمد يلعب بال",
    {
      "المنزل": false,
      "اللبن": false,
      "الكلمة": false,
      "الكرة": true,
    },
  ),
  QuestionModel("اكمل الجملة الأتيه :  احمد يأكل ال", {
    "السفينه": false,
    "الشجر": false,
    "الطعام": true,
    "الماء": false,
  }),
  QuestionModel("اكمل الجملة الأتيه :  مريم تقرأ ال", {
    "الدرس": true,
    "المنزل": false,
    "الماء": false,
    "السماء": false,
  }),
  QuestionModel("اكمل الجملة الأتيه :  سعيد يشرب ال", {
    "الماء": true,
    "القلم": false,
    "الزهرة": false,
    "الجاكت": false,
  }),
  QuestionModel("اكمل الجملة الأتيه :  علياء تسبح في ال", {
    "البحر":true ,
    "السطح": false,
    "الجمل": false,
    "النملة":false ,
  }),


  QuestionModel(
    " أختر الجملة التي تبدأ بحرف الالف",
    {
      "بطه": false,
      "قطه": false,
      "حطب": false,
      "أسد": true,
    },
  ),
  QuestionModel("أختر الجملة التي تبدأ بحرف العين", {
    "كلب": false,
    "قطه": false,
    "عين": true,
    "كل ما سبق": false,
  }),
  QuestionModel("أختر الجملة التي تبدأ بحرف الحاء", {
    "حروف": true,
    "جمل": false,
    "خروف": false,
    "لا توجد كلمات": false,
  }),
  QuestionModel("أختر الجملة التي تبدأ بحرف الواو", {
    "ولد": true,
    "سيارة": false,
    "طائرة": false,
    "لا توجد كلمات": false,
  }),
  QuestionModel("أختر الجملة التي تبدأ بحرف الياء", {
    "مسمار": false,
    "منضاد": false,
    "قلم": false,
    "يخت": true,
  }),
  QuestionModel(
    "قم بإجاد كلمة باللغة الانجليزية مما يلي تبدأ بحرف ال : A",
    {
      "منزل": false,
      "كلب": false,
      "قطة": false,
      "تفاحة": true,
    },
  ),
  QuestionModel("قم بإجاد كلمة باللغة الانجليزية مما يلي تبدأ بحرف ال : B", {
    "سفينه": false,
    "شجر": false,
    "كتاب": true,
    "ماء": false,
  }),
  QuestionModel("قم بإجاد كلمة باللغة الانجليزية مما يلي تبدأ بحرف ال : G", {
    "قمامة": true,
    "كلب": false,
    "تفاحة": false,
    "قلم": false,
  }),
  QuestionModel("قم بإجاد كلمة باللغة الانجليزية مما يلي تبدأ بحرف ال : Z", {
    "حديقة حيوان": true,
    "قلم رصاص": false,
    "دراجة": false,
    "بطيخة": false,
  }),
  QuestionModel("قم بإجاد كلمة باللغة الانجليزية مما يلي تبدأ بحرف ال : O", {
    "برتقالة":true ,
    "تاكسي": false,
    "موتور": false,
    "سيارة":false ,
  }),

];
